# Getting Financial Data - Pandas Datareader

### Introduction:

This time you will get data from a website.


### Step 1. Import the necessary libraries

In [13]:
import pandas as pd
from datetime import datetime

import pandas_datareader.data as web

### Step 2. Create your time range (start and end variables). The start date should be 01/01/2015 and the end should today (whatever your today is).

In [18]:
date = pd.date_range(end = datetime.today(), start = '01/01/2015' ,  periods = 100).to_list()

### Step 3. Get an API key for one of the APIs that are supported by Pandas Datareader, preferably for AlphaVantage.

If you do not have an API key for any of the supported APIs, it is easiest to get one for [AlphaVantage](https://www.alphavantage.co/support/#api-key). (Note that the API key is shown directly after the signup. You do *not* receive it via e-mail.)

(For a full list of the APIs that are supported by Pandas Datareader, [see here](https://pydata.github.io/pandas-datareader/readers/index.html). As the APIs are provided by third parties, this list may change.)

### Step 4. Use Pandas Datarader to read the daily time series for the Apple stock (ticker symbol AAPL) between 01/01/2015 and today, assign it to df_apple and print it.

In [24]:
apple = web.DataReader("AAPL", "av-daily", start=datetime(2015,1,1),end=datetime.today(), api_key='J6NC6TRXN1STPEZI')
apple.head()

              open    high      low   close    volume
2015-01-02  111.39  111.44  107.350  109.33  53204626
2015-01-05  108.29  108.65  105.410  106.25  64285491
2015-01-06  106.54  107.43  104.630  106.26  65797116
2015-01-07  107.20  108.20  106.695  107.75  40105934
2015-01-08  109.23  112.15  108.700  111.89  59364547

### Step 5. Add a new column "stock" to the dataframe and add the ticker symbol

In [25]:
apple['stock'] = 'AAPL'

### Step 6. Repeat the two previous steps for a few other stocks, always creating a new dataframe: Tesla, IBM and Microsoft. (Ticker symbols TSLA, IBM and MSFT.)

In [29]:
msft = web.DataReader("MSFT", "av-daily", start=datetime(2015,1,1),end=datetime.today(), api_key='J6NC6TRXN1STPEZI')
msft['stock'] = 'MSFT'
msft.head()

             open     high    low   close    volume stock
2015-01-02  46.66  47.4200  46.54  46.760  27913852  MSFT
2015-01-05  46.37  46.7300  46.25  46.325  39673865  MSFT
2015-01-06  46.38  46.7490  45.54  45.650  36447854  MSFT
2015-01-07  45.98  46.4600  45.49  46.230  29114061  MSFT
2015-01-08  46.75  47.7499  46.72  47.590  29645202  MSFT

In [27]:
ibm = web.DataReader("IBM", "av-daily", start=datetime(2015,1,1),end=datetime.today(), api_key='J6NC6TRXN1STPEZI')
ibm['stock'] = 'IBM'
ibm.head()

              open     high     low   close   volume stock
2015-01-02  161.31  163.310  161.00  162.06  5525341   IBM
2015-01-05  161.27  161.270  159.19  159.51  4880389   IBM
2015-01-06  159.67  159.960  155.17  156.07  6145670   IBM
2015-01-07  157.20  157.200  154.03  155.05  4701015   IBM
2015-01-08  156.24  159.044  155.55  158.42  4240585   IBM

In [28]:
tesla = web.DataReader("TSLA", "av-daily", start=datetime(2015,1,1),end=datetime.today(), api_key='J6NC6TRXN1STPEZI')
tesla['stock'] = 'TSLA'
tesla.head()

              open      high       low    close   volume stock
2015-01-02  222.87  223.2500  213.2600  219.310  4764443  TSLA
2015-01-05  214.55  216.5000  207.1626  210.090  5368477  TSLA
2015-01-06  210.06  214.2000  204.2100  211.280  6261936  TSLA
2015-01-07  213.35  214.7800  209.7800  210.950  2968390  TSLA
2015-01-08  212.81  213.7999  210.0100  210.615  3442509  TSLA

### Step 7. Combine the four separate dataFrames into one combined dataFrame df that holds the information for all four stocks

In [122]:
df = pd.concat([apple,msft,tesla,ibm])
df

              open    high      low   close    volume stock
2015-01-02  111.39  111.44  107.350  109.33  53204626  AAPL
2015-01-05  108.29  108.65  105.410  106.25  64285491  AAPL
2015-01-06  106.54  107.43  104.630  106.26  65797116  AAPL
2015-01-07  107.20  108.20  106.695  107.75  40105934  AAPL
2015-01-08  109.23  112.15  108.700  111.89  59364547  AAPL
...            ...     ...      ...     ...       ...   ...
2022-09-26  122.30  124.26  121.750  122.01   3987817   IBM
2022-09-27  122.60  123.95  121.080  121.74   4117215   IBM
2022-09-28  121.65  123.23  119.810  122.76   4996378   IBM
2022-09-29  121.85  122.62  120.570  121.63   3817723   IBM
2022-09-30  121.66  122.43  118.610  118.81   5346108   IBM

[7804 rows x 6 columns]

### Step 8. Shift the stock column into the index (making it a multi-level index consisting of the ticker symbol and the date).

In [123]:
df = df.set_index('stock',append=True)
df.head()

                    open    high      low   close    volume
           stock
2015-01-02 AAPL   111.39  111.44  107.350  109.33  53204626
2015-01-05 AAPL   108.29  108.65  105.410  106.25  64285491
2015-01-06 AAPL   106.54  107.43  104.630  106.26  65797116
2015-01-07 AAPL   107.20  108.20  106.695  107.75  40105934
2015-01-08 AAPL   109.23  112.15  108.700  111.89  59364547

### Step 7. Create a dataFrame called vol, with the volume values.

In [149]:
vol = df['volume'].to_frame()
vol.head()

                    volume
           stock
2015-01-02 AAPL   53204626
2015-01-05 AAPL   64285491
2015-01-06 AAPL   65797116
2015-01-07 AAPL   40105934
2015-01-08 AAPL   59364547

### Step 8. Aggregate the data of volume to weekly.
Hint: Be careful to not sum data from the same week of 2015 and other years.

In [150]:
vol_week = vol.rename_axis(index=['dt', 'stock'])
vol_week.reset_index(inplace=True)
vol_week.dt = pd.to_datetime(vol_week.dt)
vol_week['year'] = vol_week['dt'].map(lambda x: x.year)
vol_week['week'] = vol_week['dt'].map(lambda x: x.week)
vol_week.pop('dt')

vol_week.set_index(['year', 'week', 'stock'], inplace=True)
vol_week = vol_week.groupby([pd.Grouper(level='stock'), pd.Grouper(level='year'), pd.Grouper(level='week')]).sum()

vol_week = vol_week.reset_index()
vol_week = vol_week.pivot(index=['year', 'week'], columns='stock')
vol_week.columns.droplevel(0)
vol_week.columns = vol_week.columns.droplevel(0)
vol_week

stock           AAPL       IBM       MSFT       TSLA
year week
2015 1      53204626   5525341   27913852    4764443
     2     282868187  24440360  158596624   22622034
     3     304226647  23272056  157088136   30799137
     4     198737041  31230797  137352632   16215501
     5     465842684  32927307  437786778   15720217
...              ...       ...        ...        ...
2022 35    389809404  15086608  113799087  249374939
     36    313749966  12004834   87823670  213818141
     37    568337936  27107187  147336678  341416185
     38    473155533  19442664  147215927  318285640
     39    577537048  22265241  146921666  320014147

[405 rows x 4 columns]

### Step 9. Find all the volume traded in the year of 2015

In [151]:
vol_year = vol_week.groupby('year').sum()
vol_year.loc[2015:2015]

stock         AAPL         IBM        MSFT        TSLA
year
2015   13064316775  1105545521  9057582311  1086708380